# ShowByClassChoice

## Description
Adds a 'By Class' choice to a marker, line style, or color popup control.  (Dialog must be running)

```pascal
PROCEDURE ShowByClassChoice(
				dialogID    : LONGINT;
				componentID : LONGINT);
```

```python

def vs.ShowByClassChoice(dialogID, componentID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|Id of the dialog|
|componentID|LONGINT|Id of the popup control|

## Version
Availability: from Vectorworks 2012
## Category
* Dialogs - Modern